```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_firebase_android_app_config.release will be read during apply
  # (config refers to values not yet known)
 <= data "google_firebase_android_app_config" "release" {
      + app_id               = (known after apply)
      + config_file_contents = (known after apply)
      + config_filename      = (known after apply)
      + id                   = (known after apply)
    }

  # github_actions_secret.main["FIREBASE_ANDROID_APP_ID"] will be created
  + resource "github_actions_secret" "main" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "playground.ashdavies.dev"
      + secret_name     = "FIREBASE_ANDROID_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.main["FIREBASE_GOOGLE_SERVICES"] will be created
  + resource "github_actions_secret" "main" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "playground.ashdavies.dev"
      + secret_name     = "FIREBASE_GOOGLE_SERVICES"
      + updated_at      = (known after apply)
    }

  # google_firebase_android_app.release must be replaced
-/+ resource "google_firebase_android_app" "release" {
      ~ api_key_id      = "ecc12a8f-74fe-4f10-bede-c60d4b5db5e3" -> (known after apply)
      ~ app_id          = "1:279861227938:android:4d6b627f92453ce0c502fb" -> (known after apply)
      ~ display_name    = "Tally Release" -> "Playground Debug"
      ~ etag            = "1_8efb1aaa-f3bf-41f5-a912-98e986a2673d" -> (known after apply)
      ~ id              = "projects/playground-1a136/androidApps/1:279861227938:android:4d6b627f92453ce0c502fb" -> (known after apply)
      ~ name            = "projects/playground-1a136/androidApps/1:279861227938:android:4d6b627f92453ce0c502fb" -> (known after apply)
      ~ package_name    = "io.ashdavies.tally" -> "dev.ashdavies.playground.debug" # forces replacement
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 1 to destroy.
```
<!-- thollander/actions-comment-pull-request "terraform-plan" -->